app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`price`, `created_at`, `title`, `updated_at`, `desc`, `imge_url`) VALUES(0, '2010-01-27 16:02:06', 'admin', '2010-01-27 16:02:06', 'fdsajfdasj', 'fakjfdakjfdas')

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)
UPDATE `products` SET `updated_at` = '2010-05-19 15:33:48', `imge_url` = 'fdasf', `title` = 'fdsafd', `desc` = 'fdasf' WHERE `id` = 1

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT * FROM `products` WHERE (`products`.`id` = 2053932785)
DELETE FROM `products` WHERE `id` = 2053932785